# encoding=utf-8

import urllib
from urlparse import urlparse, urljoin

""" 初始的待爬队列 """
weiboID = [
    '1797054534', '2509414473', '2611478681', '5861859392', '2011086863', '5127716917', '1259110474', '5850775634', '1886437464',
    '3187474530', '2191982701', '1940562032', '5874450550', '1337925752', '2081079420', '5664530558', '3493173952', '1202806915',
    '1864507535', '2032640064', '5585682587', '3083673764', '5342109866', '5878685868', '5728706733', '2103050415', '5876752562',
    '3138085045', '5775974583', '1879400644', '2417139911', '5836619975', '5353816265', '5219508427', '1766613205', '2480158031',
    '5660754163', '2456764664', '3637354755', '1940087047', '5508473104', '1004454162', '2930327837', '1874608417', '5379621155',
    '1720664360', '2714280233', '3769073964', '5624119596', '2754904375', '5710151998', '5331042630', '5748179271', '2146132305',
    '2313896275', '3193618787', '5743059299', '1742930277', '5310538088', '1794474362', '2798510462', '3480076671', '5678653833',
    '5743657357', '5460191980', '1734164880', '5876988653', '5678031258', '5860163996', '1496924574', '5878970110', '1679704482',
    '1142210982', '3628925351', '1196397981', '1747485107', '5675893172', '5438521785', '2192269762', '1992614343', '5878686155',
    '2407186895', '5559116241', '2528477652', '1295950295', '5038203354', '3659276765', '2126733792', '5878350307', '2761179623',
    '5484511719', '5825708520', '1578230251', '5878686190', '5810946551', '3833070073', '1795047931', '5855789570', '3580125714',
    '5709578773', '5236539926', '2907633071', '1709244961', '5405450788', '3251257895', '5054538290', '2713199161', '5698445883',
    '1784537661', '3195290182', '1824506454', '5738766939', '5565915740', '5336031840', '5098775138', '5685568105', '1774289524',
    '2932662914', '5433223957', '2680044311', '1111523983', '5067889432', '5878686362', '2844992161', '3878314663', '1766548141',
    '5763269297', '5878383287', '5235499706', '5876375670', '5866447563', '5129945819', '1704116960', '1929380581', '1223762662',
    '1193476843', '2899591923', '5162099453', '5072151301', '5385741066', '5411455765', '2685535005', '2297905950', '1216766752',
    '5838668577', '5359133478', '3077460103', '5577802539', '5862392623', '1786700611', '1259258694', '1845191497', '1731838797',
    '1740301135', '2816074584', '1217733467', '5345035105', '5050827618', '5486257001', '5767857005', '2050605943', '5733778298',
    '1914725244', '5872583558', '5604377483', '1253491601', '5554922386', '3170223002', '5662737311', '3217179555', '1538163622',
    '5304533928', '5644198830', '1896650227', '5298774966', '2795873213', '1834378177', '5769651141', '2656256971', '5876433869',
    '1826792401', '3002246100', '3082519511', '5780366296', '5704696797', '5204108258', '2090615793', '1739746131', '1378010100',
    '5741331445', '2376442895', '3638486041', '5781365789', '1827234850', '5703214121', '1855398955', '1227908142', '5703820334',
]
weiboID = [
        '1722123442'
]
weiboID = [
        '1722123442', #史悲
        '2019071187', #罗小黑
        '5403534267', #聊天斗图
        '5272575915', #宋民国表情包精选
        '3167305545', #每天一张萌宠动物图
        '2095611192', #演技车祸现场最新毒舌点评
        '5871645364', #沙梨熊写了新的历史八卦
        '2146965345', #大咕咕咕鸡有新的严肃文学作品
        '6178699382', #大力哥最新搞笑视频
        '1764772175', #Dick_Ng漫画有更新
        '3222817584', #ipanda熊猫萌图
        '1771123430', #热门电影预告片
        '3840084769', #微博博主骨朵网络影视个人主页
        '3986147355', #新剧不能停
        '5819881382', #赵丽颖日常动态提醒
        '1870415713', #青春剧透社
        '1642591402', #新浪娱乐
]

weibo_urls = [
        'https://weibo.cn/1722123442', #史悲
        'https://weibo.cn/2019071187', #罗小黑
        'https://weibo.cn/5403534267', #聊天斗图
        'https://weibo.cn/5272575915', #宋民国表情包精选
        'https://weibo.cn/3167305545', #每天一张萌宠动物图
        'https://weibo.cn/2095611192', #演技车祸现场最新毒舌点评
        'https://weibo.cn/5871645364', #沙梨熊写了新的历史八卦
        'https://weibo.cn/2146965345', #大咕咕咕鸡有新的严肃文学作品
        'https://weibo.cn/6178699382', #大力哥最新搞笑视频
        'https://weibo.cn/1764772175', #Dick_Ng漫画有更新
        'https://weibo.cn/3222817584', #ipanda熊猫萌图
        'https://weibo.cn/1771123430', #热门电影预告片
        'https://weibo.cn/3840084769', #微博博主骨朵网络影视个人主页
        'https://weibo.cn/3986147355', #新剧不能停
        'https://weibo.cn/5819881382', #赵丽颖日常动态提醒
        'https://weibo.cn/1870415713', #青春剧透社
        'https://weibo.cn/1642591402', #新浪娱乐
        'https://weibo.cn/chenzhentongxue', #陈震
        'https://weibo.cn/1886672467', #看看人家怎么玩手办的
        'https://weibo.cn/3178541805', #动漫绘制技巧
        'https://weibo.cn/1671194705', #我和女儿的日常漫画
        'https://weibo.cn/5466517185', #赵石的声音
        'https://weibo.cn/2286017507', #鳄鱼日记最新
        'https://weibo.cn/1769684987', #午夜回响
        'https://weibo.cn/1811865445', #韩语歌学习机
        'https://weibo.cn/3878404025', #华晨宇最新资讯
        'https://weibo.cn/2792589472', #油管红人热门翻唱视频
        'https://weibo.cn/2212758830', #1022女生有最新翻唱作品
        'https://weibo.cn/5261682202', #海外大牌音乐节
        'https://weibo.cn/6042105142', #百听不厌的音乐现场
        'https://weibo.cn/5500491427', #新出了优秀的独立游戏
        'https://weibo.cn/6137455005', #steam游戏支持中文了
        'https://weibo.cn/5844573935', #网红零食安利
        'https://weibo.cn/5882998192', #pony小姐姐视频更新
        'https://weibo.cn/2842442467', #热门彩妆试色
        'https://weibo.cn/5883682290', #匹肤有新的护肤品评测视频
        'https://weibo.cn/1249685117', #女生穿搭looklook
        'https://weibo.cn/2676774873', #土产研究所
        'https://weibo.cn/1741514817', #星巴克优惠活动和新品推荐
        'https://weibo.cn/1785749160', #宜家家居优惠提醒
        'https://weibo.cn/6004281123', #梨视频
        'https://weibo.cn/1640601392', #资讯短视频精选推荐
        'https://weibo.cn/1768008414', #值得一看的短视频推荐
        'https://weibo.cn/1915556097', #网红猫咖喱最新萌图
        'https://weibo.cn/3901429666', #谷阿莫说故事有新作品
        'https://weibo.cn/5759186675', #网红大揭秘
        'https://weibo.cn/3217179555', #回忆专用小马甲更博提醒
        'https://weibo.cn/2044145800', #奇葩二货的日常
        'https://weibo.cn/5676304901', #体育新闻媒体b/rins精选
        'https://weibo.cn/6040514775', #2020奥运会最新消息
        'https://weibo.cn/linewebtoon', #每日漫画
        'https://weibo.cn/pixivchan', #Pixiv每日排行
        'https://weibo.cn/ryuetsuya', #有趣的二次元日推
        'https://weibo.cn/275500255', #又有新的民乐改编
        'https://weibo.cn/richboxx', #音乐车祸现场
        'https://weibo.cn/oemk', #音乐不严肃
        'https://weibo.cn/234530265', #腹黑音乐冷知识
        'https://weibo.cn/bigbangfanscom', #Bigbang最新资讯
        'https://weibo.cn/517656716', #游戏玩家的日常
        'https://weibo.cn/a9vg', #任天堂又出新游戏了
        'https://weibo.cn/foodvideo', #美食台每日视频
        'https://weibo.cn/findjapan', #霓虹国美食精选
        'https://weibo.cn/yitcom', #一条有新视频
        'https://weibo.cn/277114280', #微博化妆品种草
        'https://weibo.cn/qilixiang', #李想点评汽车提醒
        'https://weibo.cn/watsonschina', #屈臣氏优惠提醒
        'https://weibo.cn/watsonschina', #图书网购折扣优惠
        'https://weibo.cn/uniqlo', #优衣库和GU新品上架
        'https://weibo.cn/mujish', #muji最新优惠与新品推荐
        'https://weibo.cn/foodvideo', #美食台每日视频
        'https://weibo.cn/wangzheDMW', #王者不修图
        'https://weibo.cn/2634154091', #虫虫的微博更新
        'https://weibo.cn/sodasoccer', #这些梗只有足球狗懂
        'https://weibo.cn/cctv5', #CCTV5精选
        'https://weibo.cn/entpaparazzi', #娱乐圈抄袭风波速报
        'https://weibo.cn/Jerrychen0622', #八卦星文
        'https://weibo.cn/xltv', #明星撕逼速报
        'https://weibo.cn/starjiepai', #女明星走光提醒
        'https://weibo.cn/sogaynews', #全球同志新闻
        'https://weibo.cn/finance', #财经资讯
        'https://weibo.cn/yicairibao', #第一财经
        'https://weibo.cn/qilixiang', #李想点评汽车提醒
        ]

def get_user_urls():
    '''
    1 统一为转https://weibo.cn/videosohu  这种格式
    '''
    host = 'https://weibo.cn/'
    R = []
    for url in weibo_urls:
        result = urlparse(url)
        new_url = urljoin(host, result.path.replace('u/', ''))
        R.append(new_url)
    return R

def get_topic_urls():
    topics = [
            u'我的观影故事',
            u'图解电影午夜场',
            u'知乎钓鱼贴图',
            u'十万个小肉段',
            u'最萌宠物',
            u'北京猫咪领养',
            u'家有柴犬',
            u'晚安物语',
            u'薛之谦粉丝今天碰瓷了吗',
            u'今天大张伟的粉丝道歉了吗',
            u'评论音轨',
            u'花絮集中营',
            u'童年阴影又来了',
            ]
    topic_urls = []
    for topic in topics:
        url = 'https://m.weibo.cn/k/%s?from=feed' % urllib.quote(topic.encode('utf8'))
        topic_urls.append(url)
    _topic_urls = [
            'https://m.weibo.cn/k/%E6%88%91%E7%9A%84%E8%A7%82%E5%BD%B1%E6%95%85%E4%BA%8B?from=feed', #我的观影故事
            'https://m.weibo.cn/k/%E5%9B%BE%E8%A7%A3%E7%94%B5%E5%BD%B1%E5%8D%88%E5%A4%9C%E5%9C%BA?from=feed', #图解电影午夜场
            'https://m.weibo.cn/k/%E7%9F%A5%E4%B9%8E%E9%92%93%E9%B1%BC%E8%B4%B4%E5%9B%BE%E7%89%87%E7%89%88?from=feed', #知乎钓鱼贴图
            'https://m.weibo.cn/k/%E5%8D%81%E4%B8%87%E4%B8%AA%E5%B0%8F%E8%82%89%E6%AE%B5?from=feed',#十万个小肉段
            ]
    return topic_urls

if __name__ == '__main__':
    for u in get_topic_urls():
        print u

